{
  "title": {
    "text": "RFC 6811 - BGP Prefix Origin Validation",
    "zh": "RFC 6811 - BGP 前缀来源验证"
  },
  "number": 6811,
  "created_at": "2023-12-04 21:35:20.074834+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      P. Mohapatra\nRequest for Comments: 6811                                 Cisco Systems\nCategory: Standards Track                                     J. Scudder\nISSN: 2070-1721                                         Juniper Networks\n                                                                 D. Ward\n                                                           Cisco Systems\n                                                                 R. Bush\n                                               Internet Initiative Japan\n                                                              R. Austein\n                                                    Dragon Research Labs\n                                                            January 2013",
      "raw": true,
      "zh": ""
    },
    {
      "indent": 22,
      "text": "BGP Prefix Origin Validation",
      "zh": "BGP 前缀来源验证"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh": "摘要"
    },
    {
      "indent": 3,
      "text": "To help reduce well-known threats against BGP including prefix mis-announcing and monkey-in-the-middle attacks, one of the security requirements is the ability to validate the origination Autonomous System (AS) of BGP routes. More specifically, one needs to validate that the AS number claiming to originate an address prefix (as derived from the AS_PATH attribute of the BGP route) is in fact authorized by the prefix holder to do so. This document describes a simple validation mechanism to partially satisfy this requirement.",
      "zh": "为了减少众所周知的 BGP 威胁（包括前缀误报和中间人攻击），安全要求之一是能够验证 BGP 路由的发源自治系统 (AS)。更具体地说，我们需要验证声称发起地址前缀（从 BGP 路由的 AS_PATH 属性中得出）的 AS 编号是否确实得到了前缀持有者的授权。本文档介绍了一种简单的验证机制，可部分满足这一要求。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh": "本备忘录的地位"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh": "本文件是互联网工程任务组 (IETF) 的成果。它代表了 IETF 社区的共识。它已接受公众审查，并经互联网工程指导小组 (IESG) 批准发布。有关互联网标准的更多信息，请参见 RFC 5741 第 2 节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6811.",
      "zh": "有关本文件的当前状态、任何勘误以及如何提供反馈的信息，请访问 http://www.rfc-editor.org/info/rfc6811。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh": "版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh": "版权所有 (c) 2013 IETF 信托基金会和文件作者。保留所有权利。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh": "本文档受 BCP 78 和本文档发布之日有效的 IETF 信托基金《与 IETF 文档有关的法律规定》 (http://trustee.ietf.org/license-info) 的约束。请仔细阅读这些文件，因为它们描述了您对本文档的权利和限制。从本文档中提取的代码组件必须包含信托法律条款第 4.e 节中所述的简化 BSD 许可文本，并且不提供简化 BSD 许可中所述的担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n  1.1.  Requirements Language . . . . . . . . . . . . . . . . . . . 4\n2.  Prefix-to-AS Mapping Database . . . . . . . . . . . . . . . . . 4\n  2.1.  Pseudo-Code . . . . . . . . . . . . . . . . . . . . . . . . 6\n3.  Policy Control  . . . . . . . . . . . . . . . . . . . . . . . . 6\n4.  Interaction with Local Cache  . . . . . . . . . . . . . . . . . 7\n5.  Deployment Considerations . . . . . . . . . . . . . . . . . . . 7\n6.  Security Considerations . . . . . . . . . . . . . . . . . . . . 7\n7.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . . . 8\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 8\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . . . 8\n  8.2.  Informational References  . . . . . . . . . . . . . . . . . 9",
      "raw": true,
      "toc": true,
      "zh": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh": "1. 导言"
    },
    {
      "indent": 3,
      "text": "A BGP route associates an address prefix with a set of Autonomous Systems (ASes) that identify the interdomain path the prefix has traversed in the form of BGP announcements. This set is represented as the AS_PATH attribute in BGP [RFC4271] and starts with the AS that originated the prefix. To help reduce well-known threats against BGP including prefix mis-announcing and monkey-in-the-middle attacks, one of the security requirements is the ability to validate the origination AS of BGP routes. More specifically, one needs to validate that the AS number claiming to originate an address prefix (as derived from the AS_PATH attribute of the BGP route) is in fact authorized by the prefix holder to do so. This document describes a simple validation mechanism to partially satisfy this requirement.",
      "zh": "BGP 路由将地址前缀与一组自治系统（AS）相关联，这些自治系统以 BGP 公告的形式标识了前缀所经过的域间路径。这组属性在 BGP [RFC4271] 中表示为 AS_PATH，并以发起前缀的 AS 开始。为了减少众所周知的 BGP 威胁（包括前缀误报和中间人攻击），安全要求之一是能够验证 BGP 路由的发源 AS。更具体地说，我们需要验证声称发起地址前缀（从 BGP 路由的 AS_PATH 属性中得出）的 AS 号是否确实得到了前缀持有者的授权。本文档介绍了一种简单的验证机制，可部分满足这一要求。"
    },
    {
      "indent": 3,
      "text": "The Resource Public Key Infrastructure (RPKI) describes an approach to build a formally verifiable database of IP addresses and AS numbers as resources. The overall architecture of RPKI as defined in [RFC6480] consists of three main components:",
      "zh": "资源公钥基础设施（RPKI）描述了一种建立可正式验证的 IP 地址和 AS 号资源数据库的方法。RPKI 的总体架构如 [RFC6480] 所定义，由三个主要部分组成："
    },
    {
      "indent": 3,
      "text": "o a public key infrastructure (PKI) with the necessary certificate objects,",
      "zh": "o 具有必要证书对象的公钥基础设施（PKI）、"
    },
    {
      "indent": 3,
      "text": "o digitally signed routing objects, and",
      "zh": "o 数字签名路由对象，以及"
    },
    {
      "indent": 3,
      "text": "o a distributed repository system to hold the objects that would also support periodic retrieval.",
      "zh": "o 一个分布式存储库系统来保存对象，该系统还支持定期检索。"
    },
    {
      "indent": 3,
      "text": "The RPKI system is based on resource certificates that define extensions to X.509 to represent IP addresses and AS identifiers [RFC3779], thus the name RPKI. Route Origin Authorizations (ROAs) [RFC6482] are separate digitally signed objects that define associations between ASes and IP address blocks. Finally, the repository system is operated in a distributed fashion through the IANA, Regional Internet Registry (RIR) hierarchy, and ISPs.",
      "zh": "RPKI 系统以资源证书为基础，资源证书定义了 X.509 扩展，用于表示 IP 地址和 AS 标识符 [RFC3779]，因此被称为 RPKI。路由起源授权（ROAs）[RFC6482] 是单独的数字签名对象，用于定义 AS 与 IP 地址块之间的关联。最后，存储库系统通过 IANA、区域互联网注册机构 (RIR) 和 ISP 以分布式方式运行。"
    },
    {
      "indent": 3,
      "text": "In order to benefit from the RPKI system, it is envisioned that relying parties at either the AS or organization level obtain a local copy of the signed object collection, verify the signatures, and process them. The cache must also be refreshed periodically. The exact access mechanism used to retrieve the local cache is beyond the scope of this document.",
      "zh": "为了从 RPKI 系统中获益，我们设想由 AS 或组织级别的依赖方获取已签名对象集合的本地副本，验证签名并对其进行处理。缓存也必须定期刷新。用于检索本地缓存的确切访问机制超出了本文档的范围。"
    },
    {
      "indent": 3,
      "text": "Individual BGP speakers can utilize the processed data contained in the local cache to validate BGP announcements. The protocol details to retrieve the processed data from the local cache to the BGP speakers is beyond the scope of this document (refer to [RFC6810] for such a mechanism). This document proposes a means by which a BGP speaker can make use of the processed data in order to assign a \"validation state\" to each prefix in a received BGP UPDATE message.",
      "zh": "单个 BGP 发言者可利用本地缓存中包含的已处理数据来验证 BGP 公告。从本地缓存向 BGP 发言者检索已处理数据的协议细节超出了本文档的范围（有关此类机制，请参阅 [RFC6810]）。本文档提出了一种方法，使 BGP 说话者可以利用处理过的数据为收到的 BGP UPDATE 消息中的每个前缀分配一个 \"验证状态\"。"
    },
    {
      "indent": 3,
      "text": "Note that the complete path attestation against the AS_PATH attribute of a route is outside the scope of this document.",
      "zh": "请注意，针对路由的 AS_PATH 属性进行完整的路径证明不属于本文档的讨论范围。"
    },
    {
      "indent": 3,
      "text": "Like the DNS, the global RPKI presents only a loosely consistent view, depending on timing, updating, fetching, etc. Thus, one cache or router may have different data about a particular prefix than another cache or router. There is no 'fix' for this; it is the nature of distributed data with distributed caches.",
      "zh": "与 DNS 一样，全局 RPKI 也只能提供一个松散一致的视图，具体取决于时间、更新、获取等因素。因此，一个高速缓存或路由器可能与另一个高速缓存或路由器拥有不同的特定前缀数据。对此没有 \"解决办法\"；这是分布式缓存的分布式数据的本质。"
    },
    {
      "indent": 3,
      "text": "Although RPKI provides the context for this document, it is equally possible to use any other database that is able to map prefixes to their authorized origin ASes. Each distinct database will have its own particular operational and security characteristics; such characteristics are beyond the scope of this document.",
      "zh": "尽管 RPKI 为本文档提供了背景，但同样可以使用任何其他能够将前缀映射到其授权来源 AS 的数据库。每个不同的数据库都有自己特定的运行和安全特性；这些特性超出了本文档的范围。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "zh": "1.1. 要求语言"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" are to be interpreted as described in RFC 2119 [RFC2119] only when they appear in all upper case. They may also appear in lower or mixed case as English words, without special meaning.",
      "zh": "关键词 \"MUST\"、\"MUST NOT\"、\"REQUIRED\"、\"SHALL\"、\"SHALL NOT\"、\"SHOULD\"、\"SHOULD NOT\"、\"RECOMMENDED\"、\"MAY \"和 \"OPTIONAL \"只有在以大写字母出现时，才能按照 RFC 2119 [RFC2119] 中的说明进行解释。它们也可以作为英文单词以小写或混合大小写出现，但无特殊含义。"
    },
    {
      "indent": 0,
      "text": "2. Prefix-to-AS Mapping Database",
      "section_title": true,
      "zh": "2. 前缀-AS 映射数据库"
    },
    {
      "indent": 3,
      "text": "The BGP speaker loads validated objects from the cache into local storage. The objects loaded have the content (IP address, prefix length, maximum length, origin AS number). We refer to such a locally stored object as a \"Validated ROA Payload\" or \"VRP\".",
      "zh": "BGP 发言者将已验证的对象从缓存中加载到本地存储中。加载的对象包含内容（IP 地址、前缀长度、最大长度、源 AS 号码）。我们将这种本地存储对象称为 \"已验证 ROA 有效载荷 \"或 \"VRP\"。"
    },
    {
      "indent": 3,
      "text": "We define several terms in addition to \"VRP\". Where these terms are used, they are capitalized:",
      "zh": "除 \"VRP \"外，我们还定义了几个术语。在使用这些术语时，均以大写字母表示："
    },
    {
      "indent": 3,
      "text": "o Prefix: (IP address, prefix length), interpreted as is customary (see [RFC4632]).",
      "zh": "o 前缀：（IP 地址，前缀长度），按惯例解释（见 [RFC4632]）。"
    },
    {
      "indent": 3,
      "text": "o Route: Data derived from a received BGP UPDATE, as defined in [RFC4271], Section 1.1. The Route includes one Prefix and an AS_PATH; it may include other attributes to characterize the prefix.",
      "zh": "o 路由：根据 [RFC4271]，第 1.1 节中的定义，从接收到的 BGP UPDATE 导出的数据。路由包括一个前缀（Prefix）和一个 AS_PATH（AS_PATH）；它还可能包括其他属性来描述该前缀。"
    },
    {
      "indent": 3,
      "text": "o VRP Prefix: The Prefix from a VRP.",
      "zh": "o VRP 前缀：来自 VRP 的前缀。"
    },
    {
      "indent": 3,
      "text": "o VRP ASN: The origin AS number from a VRP.",
      "zh": "o VRP ASN：来自 VRP 的源 AS 号。"
    },
    {
      "indent": 3,
      "text": "o Route Prefix: The Prefix derived from a route.",
      "zh": "o 路由前缀：路由前缀： 路由产生的前缀。"
    },
    {
      "indent": 3,
      "text": "o Route Origin ASN: The origin AS number derived from a Route as follows:",
      "zh": "o 路由起源 ASN：从路由中得出的起源 AS 编号，如下所示："
    },
    {
      "indent": 6,
      "text": "* the rightmost AS in the final segment of the AS_PATH attribute in the Route if that segment is of type AS_SEQUENCE, or",
      "zh": "* 路由中 AS_PATH 属性的最后一段中最右边的 AS（如果该段是 AS_SEQUENCE 类型），或"
    },
    {
      "indent": 6,
      "text": "* the BGP speaker's own AS number if that segment is of type AS_CONFED_SEQUENCE or AS_CONFED_SET or if the AS_PATH is empty, or",
      "zh": "* BGP 发言者自己的 AS 号码（如果该段的类型是 AS_CONFED_SEQUENCE 或 AS_CONFED_SET，或者 AS_PATH 为空），或者"
    },
    {
      "indent": 6,
      "text": "* the distinguished value \"NONE\" if the final segment of the AS_PATH attribute is of any other type.",
      "zh": "* 如果 AS_PATH 属性的最终段落是任何其他类型，则区分值为 \"NONE\"。"
    },
    {
      "indent": 3,
      "text": "o Covered: A Route Prefix is said to be Covered by a VRP when the VRP prefix length is less than or equal to the Route prefix length, and the VRP prefix address and the Route prefix address are identical for all bits specified by the VRP prefix length. (That is, the Route prefix is either identical to the VRP prefix or more specific than the VRP prefix.)",
      "zh": "o 覆盖：当 VRP 前缀长度小于或等于路由前缀长度，且 VRP 前缀地址和路由前缀地址在 VRP 前缀长度指定的所有位上都相同时，则称路由前缀被 VRP 覆盖。(也就是说，路由前缀要么与 VRP 前缀相同，要么比 VRP 前缀更具体）。"
    },
    {
      "indent": 3,
      "text": "o Matched: A Route Prefix is said to be Matched by a VRP when the Route Prefix is Covered by that VRP, the Route prefix length is less than or equal to the VRP maximum length, and the Route Origin ASN is equal to the VRP ASN.",
      "zh": "o 匹配：当路由前缀被 VRP 覆盖、路由前缀长度小于或等于 VRP 最大长度、路由起始地址 ASN 等于 VRP ASN 时，路由前缀即被 VRP 匹配。"
    },
    {
      "indent": 3,
      "text": "Given these definitions, any given BGP Route will be found to have one of the following validation states:",
      "zh": "根据这些定义，任何给定的 BGP 路由都将处于以下验证状态之一："
    },
    {
      "indent": 3,
      "text": "o NotFound: No VRP Covers the Route Prefix.",
      "zh": "o 未找到：没有 VRP 覆盖路由前缀。"
    },
    {
      "indent": 3,
      "text": "o Valid: At least one VRP Matches the Route Prefix.",
      "zh": "o 有效：至少有一个 VRP 与路由前缀匹配。"
    },
    {
      "indent": 3,
      "text": "o Invalid: At least one VRP Covers the Route Prefix, but no VRP Matches it.",
      "zh": "o 无效：至少有一个 VRP 覆盖路由前缀，但没有 VRP 与之匹配。"
    },
    {
      "indent": 3,
      "text": "We observe that no VRP can have the value \"NONE\" as its VRP ASN. Thus, a Route whose Origin ASN is \"NONE\" cannot be Matched by any VRP. Similarly, no valid Route can have an Origin ASN of zero [AS0]. Thus, no Route can be Matched by a VRP whose ASN is zero.",
      "zh": "我们注意到，任何 VRP 的 VRP ASN 值都不能为 \"NONE\"。因此，起源 ASN 为 \"NONE \"的路由不能被任何 VRP 匹配。同样，任何有效路由的原点 ASN 都不能为 0 [AS0]。因此，ASN 为零的 VRP 无法匹配任何路由。"
    },
    {
      "indent": 3,
      "text": "When a BGP speaker receives an UPDATE from a neighbor, it SHOULD perform a lookup as described above for each of the Routes in the UPDATE message. The lookup SHOULD also be applied to routes that are redistributed into BGP from another source, such as another protocol or a locally defined static route. An implementation MAY provide configuration options to control which routes the lookup is applied to. The validation state of the Route MUST be set to reflect the result of the lookup. The implementation should consider the validation state as described in the document as a local property or attribute of the Route. If validation is not performed on a Route, the implementation SHOULD initialize the validation state of such a route to \"NotFound\".",
      "zh": "当 BGP 发言者从邻居接收到 UPDATE 时，它应针对 UPDATE 消息中的每条路由执行上述查找。查询也应应用于从其他来源（如其他协议或本地定义的静态路由）重新分配到 BGP 的路由。实施可提供配置选项，以控制查找应用于哪些路由。路由的验证状态必须设置为反映查找结果。实施应将本文档中描述的验证状态视为路由的本地属性或属性。如果未对路由执行验证，那么实现应将该路由的验证状态初始化为 \"未找到\"。"
    },
    {
      "indent": 3,
      "text": "Use of the validation state is discussed in Sections 3 and 5. An implementation MUST NOT exclude a route from the Adj-RIB-In or from consideration in the decision process as a side effect of its validation state, unless explicitly configured to do so.",
      "zh": "第 3 节和第 5 节将讨论验证状态的使用。除非明确配置，否则实施不得将路由排除在 Adj-RIB-In 或决策过程之外，作为其验证状态的副作用。"
    },
    {
      "indent": 3,
      "text": "We observe that a Route can be Matched or Covered by more than one VRP. This procedure does not mandate an order in which VRPs must be visited; however, the validation state output is fully determined.",
      "zh": "我们注意到，一条路由可以被多个 VRP 匹配或覆盖。该程序并没有规定必须访问 VRP 的顺序；但是，验证状态输出是完全确定的。"
    },
    {
      "indent": 0,
      "text": "2.1. Pseudo-Code",
      "section_title": true,
      "zh": "2.1. 伪代码"
    },
    {
      "indent": 3,
      "text": "The following pseudo-code illustrates the procedure above. In case of ambiguity, the procedure above, rather than the pseudo-code, should be taken as authoritative.",
      "zh": "下面的伪代码说明了上述程序。如有歧义，应以上述程序而不是伪代码为准。"
    },
    {
      "indent": 3,
      "text": "result = BGP_PFXV_STATE_NOT_FOUND;",
      "zh": "result = BGP_PFXV_STATE_NOT_FOUND；"
    },
    {
      "indent": 3,
      "text": "//Iterate through all the Covering entries in the local VRP //database, pfx_validate_table. entry = next_lookup_result(pfx_validate_table, route_prefix);",
      "zh": "//entry = next_lookup_result(pfx_validate_table, route_prefix)；"
    },
    {
      "indent": 3,
      "text": "while (entry != NULL) {\n  prefix_exists = TRUE;",
      "raw": true,
      "zh": ""
    },
    {
      "indent": 3,
      "text": "  if (route_prefix_length <= entry->max_length) {\n    if (route_origin_as != NONE\n        && entry->origin_as != 0\n        && route_origin_as == entry->origin_as) {\n      result = BGP_PFXV_STATE_VALID;\n      return (result);\n    }\n  }\n  entry = next_lookup_result(pfx_validate_table, input.prefix);\n}",
      "raw": true,
      "zh": ""
    },
    {
      "indent": 3,
      "text": "//If one or more VRP entries Covered the route prefix, but\n//none Matched, return \"Invalid\" validation state.\nif (prefix_exists == TRUE) {\n  result = BGP_PFXV_STATE_INVALID;\n}",
      "raw": true,
      "zh": ""
    },
    {
      "indent": 3,
      "text": "return (result);",
      "zh": "返回（结果）；"
    },
    {
      "indent": 0,
      "text": "3. Policy Control",
      "section_title": true,
      "zh": "3. 政策控制"
    },
    {
      "indent": 3,
      "text": "An implementation MUST provide the ability to match and set the validation state of routes as part of its route policy filtering function. Use of validation state in route policy is elaborated in Section 5. For more details on operational policy considerations, see [ORIGIN-OPS].",
      "zh": "作为路由策略过滤功能的一部分，实施必须提供匹配和设置路由验证状态的功能。路由策略中验证状态的使用将在第 5 节中详细阐述。有关运行策略考虑因素的更多详情，请参阅 [ORIGIN-OPS]。"
    },
    {
      "indent": 3,
      "text": "An implementation MUST also support four-octet AS numbers [RFC6793].",
      "zh": "实施还必须支持四八位字节 AS 号码 [RFC6793]。"
    },
    {
      "indent": 0,
      "text": "4. Interaction with Local Cache",
      "section_title": true,
      "zh": "4. 与本地缓存的交互"
    },
    {
      "indent": 3,
      "text": "Each BGP speaker supporting prefix validation as described in this document is expected to communicate with one or more RPKI caches, each of which stores a local copy of the global RPKI database. The protocol mechanisms used to gather and validate these data and present them to BGP speakers are described in [RFC6810].",
      "zh": "每个支持本文所述前缀验证的 BGP 发言者都要与一个或多个 RPKI 缓存通信，每个缓存都要存储全局 RPKI 数据库的本地副本。用于收集和验证这些数据并将其提交给 BGP 发言者的协议机制在 [RFC6810] 中进行了描述。"
    },
    {
      "indent": 3,
      "text": "The prefix-to-AS mappings used by the BGP speaker are expected to be updated over time. When a mapping is added or deleted, the implementation MUST re-validate any affected prefixes and run the BGP decision process if needed. An \"affected prefix\" is any prefix that was matched by a deleted or updated mapping, or could be matched by an added or updated mapping.",
      "zh": "BGP 发言者使用的前缀到AS 映射会随着时间的推移而更新。添加或删除映射时，实施必须重新验证任何受影响的前缀，并在必要时运行 BGP 决策流程。受影响的前缀 \"是指已被删除或更新的映射匹配的前缀，或可能被添加或更新的映射匹配的前缀。"
    },
    {
      "indent": 0,
      "text": "5. Deployment Considerations",
      "section_title": true,
      "zh": "5. 部署考虑因素"
    },
    {
      "indent": 3,
      "text": "Once a Route is selected for validation, it is categorized according the procedure given in Section 2. Subsequently, routing policy as discussed in Section 3 can be used to take action based on the validation state.",
      "zh": "路由一旦被选中进行验证，就会按照第 2 节中给出的程序进行分类。随后，第 3 节中讨论的路由策略可用于根据验证状态采取行动。"
    },
    {
      "indent": 3,
      "text": "Policies that could be implemented include filtering routes based on validation state (for example, rejecting all \"invalid\" routes) or adjusting a route's degree of preference in the selection algorithm based on its validation state. The latter could be accomplished by adjusting the value of such attributes as LOCAL_PREF. Considering invalid routes for BGP decision process is a purely local policy matter and should be done with utmost care.",
      "zh": "可实施的策略包括根据验证状态过滤路由（例如，拒绝所有 \"无效 \"路由），或根据路由的验证状态调整其在选择算法中的优先程度。后者可通过调整 LOCAL_PREF 等属性的值来实现。在 BGP 决策过程中考虑无效路由纯属本地策略问题，应慎之又慎。"
    },
    {
      "indent": 3,
      "text": "In some cases (particularly when the selection algorithm is influenced by the adjustment of a route property that is not propagated into Internal BGP (IBGP)) it could be necessary for routing correctness to propagate the validation state to the IBGP peer. This can be accomplished on the sending side by setting a community or extended community based on the validation state, and on the receiving side by matching the (extended) community and setting the validation state.",
      "zh": "在某些情况下（特别是当选择算法受路由属性调整的影响，而路由属性又未传播到内部 BGP (IBGP)时），为了保证路由的正确性，有必要将验证状态传播到 IBGP 对等体。发送端可以根据验证状态设置一个社区或扩展社区，接收端可以匹配（扩展）社区并设置验证状态。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh": "6. 安全考虑因素"
    },
    {
      "indent": 3,
      "text": "Although this specification discusses one portion of a system to validate BGP routes, it should be noted that it relies on a database (RPKI or other) to provide validation information. As such, the security properties of that database must be considered in order to determine the security provided by the overall solution. If \"invalid\" routes are blocked as this specification suggests, the overall system provides a possible denial-of-service vector; for example, if an attacker is able to inject (or remove) one or more records into (or from) the validation database, it could lead an otherwise valid route to be marked as invalid.",
      "zh": "尽管本规范讨论的是验证 BGP 路由系统的一部分，但应注意的是，它依赖于数据库（RPKI 或其他）来提供验证信息。因此，在确定整体解决方案的安全性时，必须考虑该数据库的安全属性。如果按照本规范的建议阻止 \"无效 \"路由，整个系统就会提供一个可能的拒绝服务载体；例如，如果攻击者能够向验证数据库注入（或删除）一条或多条记录，就会导致原本有效的路由被标记为无效。"
    },
    {
      "indent": 3,
      "text": "In addition, this system is only able to provide limited protection against a determined attacker -- the attacker need only prepend the \"valid\" source AS to a forged BGP route announcement in order to defeat the protection provided by this system.",
      "zh": "此外，该系统只能提供有限的保护，以抵御意志坚定的攻击者--攻击者只需将 \"有效 \"源 AS 添加到伪造的 BGP 路由公告中，就能破坏该系统提供的保护。"
    },
    {
      "indent": 3,
      "text": "This mechanism does not protect against \"AS-in-the-middle attacks\" or provide any path validation. It only attempts to verify the origin. In general, this system should be thought of more as a protection against misconfiguration than as true \"security\" in the strong sense.",
      "zh": "这种机制不能抵御 \"中间 AS 攻击\"，也不能提供任何路径验证。它只试图验证来源。一般来说，该系统更多地被视为一种防止配置错误的保护措施，而不是真正意义上的 \"安全\"。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "zh": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank Rex Fernando, Hannes Gredler, Mouhcine Guennoun, Russ Housley, Junaid Israr, Miya Kohno, Shin Miyakawa, Taka Mizuguchi, Hussein Mouftah, Keyur Patel, Tomoya Yoshida, Kannan Varadhan, Wes George, Jay Borkenhagen, and Sandra Murphy. The authors are grateful for the feedback from the members of the SIDR working group.",
      "zh": "作者感谢 Rex Fernando、Hannes Gredler、Mouhcine Guennoun、Russ Housley、Junaid Israr、Miya Kohno、Shin Miyakawa、Taka Mizuguchi、Hussein Mouftah、Keyur Patel、Tomoya Yoshida、Kannan Varadhan、Wes George、Jay Borkenhagen 和 Sandra Murphy。作者对 SIDR 工作组成员的反馈意见表示感谢。"
    },
    {
      "indent": 3,
      "text": "Junaid Israr's contribution to this specification was part of his PhD research work and thesis at University of Ottawa.",
      "zh": "Junaid Israr 对本规范的贡献是他在渥太华大学的博士研究工作和论文的一部分。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh": "8.1. 规范性文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997."
    },
    {
      "indent": 3,
      "text": "[RFC3779] Lynn, C., Kent, S., and K. Seo, \"X.509 Extensions for IP Addresses and AS Identifiers\", RFC 3779, June 2004.",
      "zh": "[RFC3779] Lynn, C., Kent, S., and K. Seo, \"X.509 Extensions for IP Addresses and AS Identifiers\", RFC 3779, June 2004."
    },
    {
      "indent": 3,
      "text": "[RFC4271] Rekhter, Y., Li, T., and S. Hares, \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, January 2006.",
      "zh": "[Rekhter, Y., Li, T., and S. Hares, \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, January 2006."
    },
    {
      "indent": 3,
      "text": "[RFC4632] Fuller, V. and T. Li, \"Classless Inter-domain Routing (CIDR): The Internet Address Assignment and Aggregation Plan\", BCP 122, RFC 4632, August 2006.",
      "zh": "[RFC4632] Fuller、V. 和 T. Li，\"无类别域间路由（CIDR）：互联网地址分配和聚合计划\"，BCP 122，RFC 4632，2006 年 8 月。"
    },
    {
      "indent": 3,
      "text": "[RFC6482] Lepinski, M., Kent, S., and D. Kong, \"A Profile for Route Origin Authorizations (ROAs)\", RFC 6482, February 2012.",
      "zh": "[RFC6482] Lepinski, M., Kent, S., and D. Kong, \"A Profile for Route Origin Authorizations (ROAs)\", RFC 6482, February 2012."
    },
    {
      "indent": 3,
      "text": "[RFC6793] Vohra, Q. and E. Chen, \"BGP Support for Four-Octet Autonomous System (AS) Number Space\", RFC 6793, December 2012.",
      "zh": "[RFC6793] Vohra, Q. and E. Chen, \"BGP Support for Four-Octet Autonomous System (AS) Number Space\", RFC 6793, December 2012."
    },
    {
      "indent": 0,
      "text": "8.2. Informational References",
      "section_title": true,
      "zh": "8.2. 信息参考"
    },
    {
      "indent": 3,
      "text": "[AS0] Kumari, W., Bush, R., Schiller, H., and K. Patel, \"Codification of AS 0 processing.\", Work in Progress, August 2012.",
      "zh": "[AS0] Kumari, W., Bush, R., Schiller, H., and K. Patel, \"Codification of AS 0 processing.\", Work in Progress, August 2012."
    },
    {
      "indent": 3,
      "text": "[ORIGIN-OPS] Bush, R., \"RPKI-Based Origin Validation Operation\", Work in Progress, August 2012.",
      "zh": "[ORIGIN-OPS] Bush, R., \"RPKI-Based Origin Validation Operation\", Work in Progress, August 2012."
    },
    {
      "indent": 3,
      "text": "[RFC6480] Lepinski, M. and S. Kent, \"An Infrastructure to Support Secure Internet Routing\", RFC 6480, February 2012.",
      "zh": "[RFC6480] Lepinski, M. and S. Kent, \"An Infrastructure to Support Secure Internet Routing\", RFC 6480, February 2012."
    },
    {
      "indent": 3,
      "text": "[RFC6810] Bush, R. and R. Austein, \"The RPKI/Router Protocol\", RFC 6810, January 2013.",
      "zh": "[RFC6810] Bush、R. 和 R. Austein，\"RPKI/路由器协议\"，RFC 6810，2013 年 1 月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh": "作者地址"
    },
    {
      "indent": 3,
      "text": "Pradosh Mohapatra Cisco Systems 170 W. Tasman Drive San Jose, CA 95134 USA",
      "zh": "Pradosh Mohapatra 思科系统 170 W. Tasman Drive San Jose, CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: pmohapat@cisco.com",
      "raw": true,
      "zh": ""
    },
    {
      "indent": 3,
      "text": "John Scudder Juniper Networks 1194 N. Mathilda Ave Sunnyvale, CA 94089 USA",
      "zh": "John Scudder Juniper Networks 1194 N. Mathilda Ave Sunnyvale, CA 94089 USA"
    },
    {
      "indent": 3,
      "text": "EMail: jgs@juniper.net",
      "raw": true,
      "zh": ""
    },
    {
      "indent": 3,
      "text": "David Ward Cisco Systems 170 W. Tasman Drive San Jose, CA 95134 USA",
      "zh": "David Ward 思科系统 170 W. Tasman Drive San Jose, CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: dward@cisco.com",
      "raw": true,
      "zh": ""
    },
    {
      "indent": 3,
      "text": "Randy Bush Internet Initiative Japan 5147 Crystal Springs Bainbridge Island, WA 98110 USA",
      "zh": "Randy Bush Internet Initiative Japan 5147 Crystal Springs Bainbridge Island, WA 98110 USA"
    },
    {
      "indent": 3,
      "text": "EMail: randy@psg.com",
      "raw": true,
      "zh": ""
    },
    {
      "indent": 3,
      "text": "Rob Austein Dragon Research Labs",
      "zh": "Rob Austein 龙研究实验室"
    },
    {
      "indent": 3,
      "text": "EMail: sra@hactrn.net",
      "raw": true,
      "zh": ""
    }
  ]
}