{
  "title": {
    "text": "RFC 6490 - Resource Public Key Infrastructure (RPKI) Trust Anchor Locator",
    "zh": "RFC 6490 - 资源公钥基础设施 (RPKI) 信任锚定位器"
  },
  "number": 6490,
  "created_at": "2023-12-04 17:10:33.346722+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         G. Huston\nRequest for Comments: 6490                                         APNIC\nCategory: Standards Track                                      S. Weiler\nISSN: 2070-1721                                             SPARTA, Inc.\n                                                           G. Michaelson\n                                                                   APNIC\n                                                                 S. Kent\n                                                                     BBN\n                                                           February 2012",
      "raw": true,
      "zh": ""
    },
    {
      "indent": 5,
      "text": "Resource Public Key Infrastructure (RPKI) Trust Anchor Locator",
      "zh": "资源公钥基础设施 (RPKI) 信任锚定位器"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines a Trust Anchor Locator (TAL) for the Resource Public Key Infrastructure (RPKI).",
      "zh": "本文件定义了资源公钥基础设施 (RPKI) 的信任锚定位器 (TAL)。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh": "本备忘录的地位"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh": "本文件是互联网工程任务组 (IETF) 的成果。它代表了 IETF 社区的共识。它已接受公众审查，并经互联网工程指导小组 (IESG) 批准发布。有关互联网标准的更多信息，请参见 RFC 5741 第 2 节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6490.",
      "zh": "有关本文件的当前状态、任何勘误以及如何提供反馈的信息，请访问 http://www.rfc-editor.org/info/rfc6490。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh": "版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh": "版权所有 (c) 2012 IETF 信托基金会和文件作者。保留所有权利。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh": "本文档受 BCP 78 和本文档发布之日有效的 IETF 信托基金《与 IETF 文档有关的法律规定》 (http://trustee.ietf.org/license-info) 的约束。请仔细阅读这些文件，因为它们描述了您对本文档的权利和限制。从本文档中提取的代码组件必须包含信托法律条款第 4.e 节中所述的简化 BSD 许可文本，并且不提供简化 BSD 许可中所述的担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Terminology ................................................2\n2. Trust Anchor Locator ............................................2\n   2.1. Trust Anchor Locator Format ................................2\n   2.2. TAL and Trust Anchor Certificate Considerations ............3\n   2.3. Example ....................................................4\n3. Relying Party Use ...............................................5\n4. Security Considerations .........................................5\n5. Acknowledgments .................................................6\n6. References ......................................................6\n   6.1. Normative References .......................................6\n   6.2. Informative References .....................................6",
      "raw": true,
      "toc": true,
      "zh": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh": "1. 导言"
    },
    {
      "indent": 3,
      "text": "This document defines a Trust Anchor Locator (TAL) for the Resource Public Key Infrastructure (RPKI) [RFC6480]. This format may be used to distribute trust anchor material using a mix of out-of-band and online means. Procedures used by Relying Parties (RPs) to verify RPKI signed objects SHOULD support this format to facilitate interoperability between creators of trust anchor material and RPs.",
      "zh": "本文件定义了资源公钥基础设施 (RPKI) [RFC6480] 的信任锚定位器 (TAL)。该格式可用于混合使用带外和在线方式分发信任锚材料。依赖方 (RP) 用于验证 RPKI 签名对象的程序应支持此格式，以促进信任锚材料创建者与 RP 之间的互操作性。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "zh": "1.1. 用语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh": "本文档中的关键词 \"MUST\"、\"MUST NOT\"、\"REQUIRED\"、\"SHALL\"、\"SHALL NOT\"、\"SHOULD\"、\"SHOULD NOT\"、\"RECOMMENDED\"、\"MAY \"和 \"OPTIONAL \"应按照 [RFC2119] 中的描述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Trust Anchor Locator",
      "section_title": true,
      "zh": "2. 信任锚定位器"
    },
    {
      "indent": 0,
      "text": "2.1. Trust Anchor Locator Format",
      "section_title": true,
      "zh": "2.1. 信任锚定位格式"
    },
    {
      "indent": 3,
      "text": "This document does not propose a new format for trust anchor material. A trust anchor in the RPKI is represented by a self-signed X.509 Certification Authority (CA) certificate, a format commonly used in PKIs and widely supported by RP software. This document specifies a format for data used to retrieve and verify the authenticity of a trust anchor in a very simple fashion. That data is referred to as the TAL.",
      "zh": "本文件并未提出新的信任锚材料格式。RPKI 中的信任锚由自签名的 X.509 认证机构 (CA) 证书表示，这是 PKI 中常用的格式，也是 RP 软件广泛支持的格式。本文档规定了一种数据格式，用于以非常简单的方式检索和验证信任锚的真实性。该数据被称为 TAL。"
    },
    {
      "indent": 3,
      "text": "The motivation for defining the TAL is to enable selected data in the trust anchor to change, without needing to effect redistribution of the trust anchor per se. In the RPKI, certificates contain extensions that represent Internet Number Resources (INRs) [RFC3779]. The set of INRs associated with an entity likely will change over time. Thus, if one were to use the common PKI convention of distributing a trust anchor to RPs in a secure fashion, this procedure would need to be repeated whenever the INR set for the trust anchor changed. By distributing the TAL (in a secure fashion) instead of the trust anchor, this problem is avoided, i.e., the TAL is constant so long as the trust anchor's public key and its location do not change.",
      "zh": "定义 TAL 的目的是使信任锚中的选定数据能够更改，而无需重新分配信任锚本身。在 RPKI 中，证书包含表示互联网号码资源（INR）的扩展[RFC3779]。与实体相关的 INRs 集很可能会随着时间的推移而改变。因此，如果使用常见的 PKI 约定，以安全的方式向 RP 分发信任锚，那么每当信任锚的 INR 集发生变化时，就需要重复这一过程。通过（以安全方式）分发 TAL 而不是信任锚，可以避免这个问题，也就是说，只要信任锚的公开密钥及其位置不发生变化，TAL 就是不变的。"
    },
    {
      "indent": 3,
      "text": "The TAL is analogous to the TrustAnchorInfo data structure [RFC5914] adopted as a PKIX standard. That standard could be used to represent the TAL, if one defined an rsync URI extension for that data structure. However, the TAL format was adopted by RPKI implementors prior to the PKIX trust anchor work, and the RPKI implementer community has elected to utilize the TAL format, rather than define the requisite extension. The community also prefers the simplicity of the ASCII encoding of the TAL versus the binary (ASN.1) encoding for TrustAnchorInfo.",
      "zh": "TAL 类似于作为 PKIX 标准采用的 TrustAnchorInfo 数据结构 [RFC5914]。如果为该数据结构定义一个 rsync URI 扩展，那么该标准就可以用来表示 TAL。不过，TAL 格式在 PKIX 信任锚工作之前就已被 RPKI 实现者采用，RPKI 实现者社区选择使用 TAL 格式，而不是定义必要的扩展。此外，与 TrustAnchorInfo 的二进制（ASN.1）编码相比，RPKI 社区更喜欢 TAL 的 ASCII 编码。"
    },
    {
      "indent": 3,
      "text": "The TAL is an ordered sequence of:",
      "zh": "TAL 是一个有序序列："
    },
    {
      "indent": 3,
      "text": "1) An rsync URI [RFC5781], 2) A <CRLF> or <LF> line break, and 3) A subjectPublicKeyInfo [RFC5280] in DER format [X.509], encoded in Base64 (see Section 4 of [RFC4648]).",
      "zh": "1) rsync URI [RFC5781]，2) <CRLF> 或 <LF> 换行符，3) 以 Base64 编码的 DER 格式 [X.509] 的 subjectPublicKeyInfo [RFC5280]（参见 [RFC4648] 第 4 节）。"
    },
    {
      "indent": 0,
      "text": "2.2. TAL and Trust Anchor Certificate Considerations",
      "section_title": true,
      "zh": "2.2. TAL 和信任锚点证书注意事项"
    },
    {
      "indent": 3,
      "text": "The rsync URI in the TAL MUST reference a single object. It MUST NOT reference a directory or any other form of collection of objects.",
      "zh": "TAL 中的 rsync URI 必须引用单个对象。不得引用目录或任何其他形式的对象集合。"
    },
    {
      "indent": 3,
      "text": "The referenced object MUST be a self-signed CA certificate that conforms to the RPKI certificate profile [RFC6487]. This certificate is the trust anchor in certification path discovery [RFC4158] and validation [RFC5280] [RFC3779].",
      "zh": "引用对象必须是符合 RPKI 证书配置文件 [RFC6487] 的自签名 CA 证书。该证书是认证路径发现 [RFC4158] 和验证 [RFC5280] [RFC3779] 中的信任锚。"
    },
    {
      "indent": 3,
      "text": "The validity interval of this trust anchor SHOULD reflect the anticipated period of stability for the particular set of INRs that are associated with the putative trust anchor.",
      "zh": "该信任锚的有效期应反映与推定信任锚相关的特定 INR 集的预期稳定期。"
    },
    {
      "indent": 3,
      "text": "The INR extension(s) of this trust anchor MUST contain a non-empty set of number resources. It MUST NOT use the \"inherit\" form of the INR extension(s). The INR set described in this certificate is the set of number resources for which the issuing entity is offering itself as a putative trust anchor in the RPKI [RFC6480].",
      "zh": "该信任锚的 INR 扩展名必须包含一组非空的数字资源。不得使用 INR 扩展名的 \"继承 \"形式。本证书中描述的 INR 集是数字资源集，签发实体在 RPKI [RFC6480] 中将自己作为推定信任锚提供。"
    },
    {
      "indent": 3,
      "text": "The public key used to verify the trust anchor MUST be the same as the subjectPublicKeyInfo in the CA certificate and in the TAL.",
      "zh": "用于验证信任锚的公钥必须与 CA 证书和 TAL 中的 subjectPublicKeyInfo 相同。"
    },
    {
      "indent": 3,
      "text": "The trust anchor MUST contain a stable key. This key MUST NOT change when the certificate is reissued due to changes in the INR extension(s), when the certificate is renewed prior to expiration or for any reason other than a key change.",
      "zh": "信任锚必须包含一个稳定的密钥。由于 INR 扩展名的更改而重新签发证书时、证书到期前续期时或由于密钥更改以外的任何原因而重新签发证书时，该密钥不得更改。"
    },
    {
      "indent": 3,
      "text": "Because the public key in the TAL and the trust anchor MUST be stable, this motivates operation of that CA in an off-line mode. Thus the entity that issues the trust anchor SHOULD issue a subordinate CA certificate that contains the same INRs (via the use of the \"inherit\" option in the INR extensions of the subordinate certificate). This allows the entity that issues the trust anchor to keep the corresponding private key of this certificate off-line, while issuing all relevant child certificates under the immediate subordinate CA. This measure also allows the Certificate Revocation List (CRL) issued by that entity to be used to revoke the subordinate CA certificate in the event of suspected key compromise of this potentially more vulnerable online operational key pair.",
      "zh": "由于 TAL 和信任锚中的公开密钥必须是稳定的，这就促使该 CA 以离线模式运行。因此，签发信任锚的实体应签发包含相同 INR 的下级 CA 证书（通过在下级证书的 INR 扩展中使用 \"继承 \"选项）。这样，签发信任锚的实体就可以将该证书的相应私钥保持在离线状态，同时签发直属下级 CA 的所有相关子证书。这项措施还允许该实体发布的证书吊销列表（CRL）在怀疑这对可能更脆弱的在线操作密钥对的密钥泄露时，用于吊销下级 CA 证书。"
    },
    {
      "indent": 3,
      "text": "The trust anchor MUST be published at a stable URI. When the trust anchor is reissued for any reason, the replacement CA certificate MUST be accessible using the same URI.",
      "zh": "信任锚必须在一个稳定的 URI 上发布。当信任锚因任何原因重新签发时，必须使用相同的 URI 访问替换的 CA 证书。"
    },
    {
      "indent": 3,
      "text": "Because the trust anchor is a self-signed certificate, there is no corresponding CRL that can be used to revoke it, nor is there a manifest [RFC6486] that lists this certificate.",
      "zh": "由于信任锚是自签名证书，因此没有相应的 CRL 可用于撤销该证书，也没有清单 [RFC6486] 列出该证书。"
    },
    {
      "indent": 3,
      "text": "If an entity wishes to withdraw a self-signed CA certificate as a putative trust anchor for any reason, including key rollover, the entity MUST remove the object from the location referenced in the TAL.",
      "zh": "如果实体出于任何原因（包括密钥展期）希望撤销作为推定信任锚的自签名 CA 证书，该实体必须从 TAL 中引用的位置删除该对象。"
    },
    {
      "indent": 0,
      "text": "2.3. Example",
      "section_title": true,
      "zh": "2.3. 示例"
    },
    {
      "indent": 3,
      "text": "rsync://rpki.example.org/rpki/hedgehog/root.cer\nMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAovWQL2lh6knDx\nGUG5hbtCXvvh4AOzjhDkSHlj22gn/1oiM9IeDATIwP44vhQ6L/xvuk7W6\nKfa5ygmqQ+xOZOwTWPcrUbqaQyPNxokuivzyvqVZVDecOEqs78q58mSp9\nnbtxmLRW7B67SJCBSzfa5XpVyXYEgYAjkk3fpmefU+AcxtxvvHB5OVPIa\nBfPcs80ICMgHQX+fphvute9XLxjfJKJWkhZqZ0v7pZm2uhkcPx1PMGcrG\nee0WSDC3fr3erLueagpiLsFjwwpX6F+Ms8vqz45H+DKmYKvPSstZjCCq9\naJ0qANT9OtnfSDOS+aLRPjZryCNyvvBHxZXqj5YCGKtwIDAQAB",
      "raw": true,
      "zh": ""
    },
    {
      "indent": 0,
      "text": "3. Relying Party Use",
      "section_title": true,
      "zh": "3. 依赖方使用"
    },
    {
      "indent": 3,
      "text": "In order to use the TAL to retrieve and validate a (putative) trust anchor, an RP SHOULD:",
      "zh": "为了使用 TAL 来检索和验证（推定）信任锚，RP 应当"
    },
    {
      "indent": 3,
      "text": "1. Retrieve the object referenced by the URI contained in the TAL.",
      "zh": "1. 读取 TAL 中包含的 URI 所引用的对象。"
    },
    {
      "indent": 3,
      "text": "2. Confirm that the retrieved object is a current, self-signed RPKI CA certificate that conforms to the profile as specified in [RFC6487].",
      "zh": "2. 确认检索对象是符合 [RFC6487] 中规定的配置文件的当前自签名 RPKI CA 证书。"
    },
    {
      "indent": 3,
      "text": "3. Confirm that the public key in the TAL matches the public key in the retrieved object.",
      "zh": "3. 确认 TAL 中的公钥与检索对象中的公钥一致。"
    },
    {
      "indent": 3,
      "text": "4. Perform other checks, as deemed appropriate (locally), to ensure that the RP is willing to accept the entity publishing this self-signed CA certificate to be a trust anchor. These checks apply to the validity of attestations made in the context of the RPKI, relating to all resources described in the INR extension of this certificate.",
      "zh": "4. 执行其他适当的检查（本地），以确保 RP 愿意接受发布此自签 CA 证书的实体为信任锚。这些检查适用于在 RPKI 范围内作出的与本证书 INR 扩展中描述的所有资源有关的证明的有效性。"
    },
    {
      "indent": 3,
      "text": "An RP SHOULD perform these functions for each instance of TAL that it is holding for this purpose every time the RP performs a re-synchronization across the local repository cache. In any case, an RP also SHOULD perform these functions prior to the expiration of the locally cached copy of the retrieved trust anchor referenced by the TAL.",
      "zh": "每次 RP 跨本地存储库缓存执行重新同步时，RP 都应为为此目的而持有的每个 TAL 实例执行这些功能。在任何情况下，RP 也应该在 TAL 所引用的检索信任锚的本地缓存副本过期之前执行这些功能。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh": "4. 安全考虑因素"
    },
    {
      "indent": 3,
      "text": "Compromise of a trust anchor private key permits unauthorized parties to masquerade as a trust anchor, with potentially severe consequences. Reliance on an inappropriate or incorrect trust anchor has similar potentially severe consequences.",
      "zh": "信任锚私人密钥被破坏后，未经授权的各方就可以伪装成信任锚，从而可能造成严重后果。依赖不适当或不正确的信任锚也可能造成类似的严重后果。"
    },
    {
      "indent": 3,
      "text": "This TAL does not directly provide a list of resources covered by the referenced self-signed CA certificate. Instead, the RP is referred to the trust anchor itself and the INR extension(s) within this certificate. This provides necessary operational flexibility, but it also allows the certificate issuer to claim to be authoritative for any resource. Relying parties should either have great confidence in the issuers of such certificates that they are configuring as trust anchors, or they should issue their own self-signed certificate as a trust anchor and, in doing so, impose constraints on the subordinate certificates. For more information on this approach, see [TA-MGMT].",
      "zh": "此 TAL 并不直接提供所引用的自签名 CA 证书所涵盖的资源列表。相反，RP 会参考信任锚本身和该证书中的 INR 扩展名。这提供了必要的操作灵活性，但也允许证书签发者声称自己对任何资源都具有权威性。依赖方要么对被配置为信任锚的证书签发者非常信任，要么签发自己的自签证书作为信任锚，并以此对下级证书施加限制。有关这种方法的更多信息，请参阅 [TA-MGMT]。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgments",
      "section_title": true,
      "zh": "5. 致谢"
    },
    {
      "indent": 3,
      "text": "This approach to trust anchor material was originally described by Robert Kisteleki.",
      "zh": "这种信任锚材料的方法最初是由罗伯特-基斯特莱基（Robert Kisteleki）描述的。"
    },
    {
      "indent": 3,
      "text": "The authors acknowledge the contributions of Rob Austein and Randy Bush, who assisted with earlier draft versions of this document and with helpful review comments.",
      "zh": "作者对 Rob Austein 和 Randy Bush 所做的贡献表示感谢，他们协助完成了本文件的初稿，并提供了有益的审阅意见。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh": "6. 参考文献"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "zh": "6.1. 规范性文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997."
    },
    {
      "indent": 3,
      "text": "[RFC3779] Lynn, C., Kent, S., and K. Seo, \"X.509 Extensions for IP Addresses and AS Identifiers\", RFC 3779, June 2004.",
      "zh": "[RFC3779] Lynn, C., Kent, S., and K. Seo, \"X.509 Extensions for IP Addresses and AS Identifiers\", RFC 3779, June 2004."
    },
    {
      "indent": 3,
      "text": "[RFC4648] Josefsson, S., \"The Base16, Base32, and Base64 Data Encodings\", RFC 4648, October 2006.",
      "zh": "[RFC4648] Josefsson, S., \"The Base16, Base32, and Base64 Data Encodings\", RFC 4648, October 2006."
    },
    {
      "indent": 3,
      "text": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, May 2008.",
      "zh": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, May 2008."
    },
    {
      "indent": 3,
      "text": "[RFC5781] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, May 2008.",
      "zh": "[RFC5781] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, May 2008."
    },
    {
      "indent": 3,
      "text": "[RFC6487] Huston, G., Michaelson, G., and R. Loomans, \"A Profile for X.509 PKIX Resource Certificates\", RFC 6487, February 2012.",
      "zh": "[RFC6487] Huston, G., Michaelson, G., and R. Loomans, \"A Profile for X.509 PKIX Resource Certificates\", RFC 6487, February 2012."
    },
    {
      "indent": 3,
      "text": "[X.509] ITU-T, \"Recommendation X.509: The Directory - Authentication Framework\", 2000.",
      "zh": "[X.509] ITU-T，\"X.509 建议：目录--身份验证框架\"，2000 年。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "zh": "6.2. 参考性文献"
    },
    {
      "indent": 3,
      "text": "[RFC4158] Cooper, M., Dzambasow, Y., Hesse, P., Joseph, S., and R. Nicholas, \"Internet X.509 Public Key Infrastructure: Certification Path Building\", RFC 4158, September 2005.",
      "zh": "[RFC4158] Cooper, M., Dzambasow, Y., Hesse, P., Joseph, S., and R. Nicholas, \"Internet X.509 Public Key Infrastructure：认证路径构建\"，RFC 4158，2005 年 9 月。"
    },
    {
      "indent": 3,
      "text": "[RFC5914] Housley, R., Ashmore, S., and C. Wallace, \"Trust Anchor Format\", RFC 5914, June 2010.",
      "zh": "[RFC5914] Housley, R., Ashmore, S., and C. Wallace, \"Trust Anchor Format\", RFC 5914, June 2010."
    },
    {
      "indent": 3,
      "text": "[RFC6480] Lepinski, M. and S. Kent, \"An Infrastructure to Support Secure Internet Routing\", RFC 6480, February 2012.",
      "zh": "[RFC6480] Lepinski, M. and S. Kent, \"An Infrastructure to Support Secure Internet Routing\", RFC 6480, February 2012."
    },
    {
      "indent": 3,
      "text": "[RFC6486] Austein, R., Huston, G., Kent, S., and M. Lepinski, \"Manifests for the Resource Public Key Infrastructure (RPKI)\", RFC 6486, February 2012.",
      "zh": "[RFC6486] Austein, R., Huston, G., Kent, S., and M. Lepinski, \"Manifests for the Resource Public Key Infrastructure (RPKI)\", RFC 6486, February 2012."
    },
    {
      "indent": 3,
      "text": "[TA-MGMT] Reynolds, M. and S. Kent, \"Local Trust Anchor Management for the Resource Public Key Infrastructure\", Work in Progress, December 2011.",
      "zh": "[TA-MGMT] Reynolds, M. and S. Kent, \"Local Trust Anchor Management for the Resource Public Key Infrastructure\", Work in Progress, December 2011."
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh": "作者地址"
    },
    {
      "indent": 3,
      "text": "Geoff Huston APNIC",
      "zh": "Geoff Huston APNIC"
    },
    {
      "indent": 3,
      "text": "EMail: gih@apnic.net\nURI:   http://www.apnic.net",
      "raw": true,
      "zh": ""
    },
    {
      "indent": 3,
      "text": "Samuel Weiler SPARTA, Inc. 7110 Samuel Morse Drive Columbia, Maryland 21046 USA",
      "zh": "塞缪尔-韦勒 斯帕塔公司美国马里兰州哥伦比亚市塞缪尔-莫尔斯大道 7110 号 邮编 21046"
    },
    {
      "indent": 3,
      "text": "EMail: weiler@tislabs.com",
      "raw": true,
      "zh": ""
    },
    {
      "indent": 3,
      "text": "George Michaelson APNIC",
      "zh": "乔治-迈克尔逊 APNIC"
    },
    {
      "indent": 3,
      "text": "EMail: ggm@apnic.net\nURI:   http://www.apnic.net",
      "raw": true,
      "zh": ""
    },
    {
      "indent": 3,
      "text": "Stephen Kent BBN Technologies 10 Moulton St. Cambridge, MA 02138 USA",
      "zh": "Stephen Kent BBN Technologies 10 Moulton St."
    },
    {
      "indent": 3,
      "text": "EMail: kent@bbn.com",
      "raw": true,
      "zh": ""
    }
  ]
}